Revit 2027 API
BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInMainModel Property
 A pad in a design option cannot be hosted by topography in the Main Model [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConfusingPadByElementsInMainModel { get; }
Public Shared ReadOnly Property ConfusingPadByElementsInMainModel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConfusingPadByElementsInMainModel {
	FailureDefinitionId^ get ();
}
static member ConfusingPadByElementsInMainModel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace